<?php
/**
 * Frontend 中文语言包
 * ============================================================================
 * Copyright © 2016-2017 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2017/3/27 12:31
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */

return [
    'Goods' => '商品',
    'Goods ID' => '商品ID',
    'Goods Name' => '商品名称',
    'Goods Price' => '商品价格',
    'Goods Market Price' => '商品市场售价',
    'Goods Content' => '商品内容',
    'Status' => '状态',
    'Created At' => '创建时间',
    'Updated At' => '更新时间',
    'Create Goods' => '创建商品',
];

