<?php
/**
 * ============================================================================
 * Copyright © 2016-2017 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2017/6/3 9:50
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */

return [
    'Goods Management' => '商品管理',
    'Goods Category' => '商品分类',
    'Create Category' => '添加分类',
];