<?php
/**
 * ============================================================================
 * Copyright © 2016-2017 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2017/3/15 20:54
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */
use yii\helpers\Html;
?>
<p>尊敬的<?= Html::encode($data['name']) ?>，您好：</p>

<p>您的找回密码链接如下：</p>

<p><a href="<?= Html::encode($data['url']) ?>"><?= Html::encode($data['url']) ?></a></p>

<p>该链接15分钟内有效，请勿传递给他人！</p>

<p>该邮件为系统自动发送，请勿回复！</p>