<?php
/**
 * ============================================================================
 * Copyright © 2016-2017 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2017/6/2 22:57
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */

return [
    'Failed to create folder. Check that the web folder has writable permissions...' => '创建文件夹失败。请检查Web文件夹是否具有可写权限...',
];