<?php
/**
 * eBestMall 基础数据模型
 * ============================================================================
 * Copyright © 2016-2017 HongYuKeJi.Co.Ltd. All rights reserved.
 * Http://www.hongyuvip.com
 * ----------------------------------------------------------------------------
 * 仅供学习交流使用，如需商用请购买商用版权。
 * 堂堂正正做人，踏踏实实做事。
 * ----------------------------------------------------------------------------
 * Author: Shadow  QQ: 1527200768  Time: 2017/9/12 14:49
 * E-mail: admin@hongyuvip.com
 * ============================================================================
 */

namespace app\models;

use Yii;
use yii\base\Model;

class BaseModel extends Model
{

}